class SkinModel{
  String imageurl;
  String desc;
  String duration;
  String price;
  String moreDesc;

  SkinModel({
    required  this.imageurl,
    required  this.price,
    required   this.desc,
    required  this.duration,
    required  this.moreDesc,
  });

  static List<SkinModel> theModels =[
    SkinModel(
        price: "1000 sp",
        desc: "معالجة اثار حب الشباب",
        duration: "40 min",
        imageurl: "https://cdn4.premiumread.com/?url=https://www.alroeya.com/uploads/images/2022/09/12/1598282.jpg&w=w850&q=100&f=jpg",
        moreDesc: "يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب "

    ),

    SkinModel(
        price: "1000 sp",
        desc: "ازالة الشعر بالليزر",
        duration: "40 min",
        imageurl: "https://media.gemini.media/img/large/2019/3/17/2019_3_17_14_27_54_749.jpg",
        moreDesc: "يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب "

    ),

    SkinModel(
        price: "1000 sp",
        desc: "توحيد لون البشرة",
        duration: "40 min",
        imageurl: "https://snd.ps/thumb/730x400/uploads/images/2019/10/FtOeO.jpeg",
        moreDesc: "يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب "

    ),

    SkinModel(
        price: "1000 sp",
        desc: "تنظيف البشرة و نضارتها",
        duration: "40 min",
        imageurl: "https://cdn.al-ain.com/images/2021/9/07/127-112019-unify-skin-tone-natural-4.jpeg",
        moreDesc: "يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب يعاني الكثير من الناس من حي الشباب "

    ),
  ];


}